In [1]:
import pandas as pd

In [3]:
pd.read_excel("E00EXAMPLE.xlsx")

    이름  국어  영어  수학  과학
0  강동원  63  93  67  71
1  송중기  89  83  71  80
2  기태영  83  76  92  98
3  김남길  94  88  73  93
4  류준열  71  83  80  88
5  박성균  67  87  92  90

In [4]:
pd.read_excel("E00EXAMPLE.xlsx").set_index("이름")

     국어  영어  수학  과학
이름
강동원  63  93  67  71
송중기  89  83  71  80
기태영  83  76  92  98
김남길  94  88  73  93
류준열  71  83  80  88
박성균  67  87  92  90

In [12]:
# DataFrame
pd.DataFrame([[3,2,5], [10,0,2], [6,5,3]], 
             index=["이성계", "김유신", "이순신"], columns=["사과", "자두", "포도"])

     사과  자두  포도
이성계   3   2   5
김유신  10   0   2
이순신   6   5   3

In [14]:
# Series
pd.Series([3, 10, 6], index=["이성계", "김유신", "이순신"])

이성계     3
김유신    10
이순신     6
dtype: int64